[
    { "id": "fact-01", "text": "The deep ocean (below 1,000 m) is almost always near 1-4 °C, making it Earth’s gigantic, refrigerator-cold thermal battery.", "tags": ["temperature", "deep-ocean"], "source": "Oceanographic Institute" },
    { "id": "fact-02", "text": "At the ocean's deepest point, the pressure is over 1,100 times that at the surface — like stacking thousands of atmospheres on your chest.", "tags": ["pressure", "deep-sea"], "source": "Marine Science Today" },
    { "id": "fact-03", "text": "The global mid-ocean ridge is the longest mountain range on Earth, stretching ~60,000 km, but it runs almost entirely underwater.", "tags": ["geology", "discovery"], "source": "NatGeo" },
    { "id": "fact-04", "text": "A water parcel in the ocean's 'global conveyor belt' can take about a thousand years to complete a full circuit around the planet.", "tags": ["currents", "thermohaline"], "source": "NOAA" },
    { "id": "fact-05", "text": "Roughly 80% of the ocean floor remains unmapped at high resolution. We know more about the surface of Mars than our own deep seas.", "tags": ["exploration", "mapping"], "source": "Schmidt Ocean Institute" },
    { "id": "fact-06", "text": "Phytoplankton, tiny plants in the surface ocean, produce roughly half of all the oxygen on Earth. Thank the ocean for every other breath!", "tags": ["biology", "oxygen"], "source": "NASA" },
    { "id": "fact-07", "text": "Sound travels so efficiently in the 'SOFAR channel' of the ocean that a whale's call can travel thousands of kilometers.", "tags": ["acoustics", "biology"], "source": "Discovery of Sound in the Sea" },
    { "id": "fact-08", "text": "Oceanographers identify water masses by their unique Temperature-Salinity (T-S) fingerprints, which act like the water's DNA.", "tags": ["measurements", "oceanography"], "source": "Argo Program" },
    { "id": "fact-09", "text": "Tiny changes in sea-surface height, measured by satellites, reveal the speed and direction of major currents from space.", "tags": ["currents", "satellite"], "source": "NASA" },
    { "id": "fact-10", "text": "The Great Pacific Garbage Patch isn't a solid island, but a vast, rotating gyre of debris concentrated by ocean currents.", "tags": ["pollution", "currents"], "source": "Ocean Cleanup" },
    { "id": "fact-11", "text": "Bioluminescent plankton can make entire waves or shorelines glow at night, creating a mesmerizing natural light show.", "tags": ["biology", "bioluminescence"], "source": "Scripps" },
    { "id": "fact-12", "text": "Average seawater salinity is 35 PSU. Tiny changes in this value can make massive currents sink or float, driving global circulation.", "tags": ["salinity", "currents"], "source": "Oceanographic Institute" },
    { "id": "fact-13", "text": "Some ocean layers, called Oxygen Minimum Zones, are naturally low in oxygen and are expanding, reshaping where marine animals can live.", "tags": ["oceanography", "omz"], "source": "NOAA" },
    { "id": "fact-14", "text": "The Gulf Stream current transports enormous amounts of heat across the Atlantic, dramatically warming and moderating climates in Europe.", "tags": ["currents", "climate"], "source": "Met Office" },
    { "id": "fact-15", "text": "Deep-sea creatures thrive where sunlight never reaches by using chemosynthesis, creating energy from chemical reactions at hydrothermal vents.", "tags": ["biology", "deep-sea"], "source": "WHOI" },
    { "id": "fact-16", "text": "A standard Argo float completes a cycle of diving to 2,000m, drifting, and surfacing to transmit data every 10 days.", "tags": ["argo", "cycle"], "source": "Argo Program" },
    { "id": "fact-17", "text": "The Baltic Sea is almost brackish, with a salinity as low as 5-10 PSU, compared to the open ocean's average of 35 PSU.", "tags": ["salinity", "geography"], "source": "Helsinki Commission" },
    { "id": "fact-18", "text": "Surface ocean temperatures can swing from -2°C in polar seas to over 35°C in tropical lagoons — a massive difference across the planet.", "tags": ["temperature", "surface"], "source": "NASA" },
    { "id": "fact-19", "text": "Data from Argo floats is made public within hours of being transmitted, offering a near real-time look at the state of our oceans.", "tags": ["data", "argo"], "source": "Argo Data Management" },
    { "id": "fact-20", "text": "Special BGC (Biogeochemical) Argo floats can measure vital signs of ocean health like oxygen, pH, and nutrients.", "tags": ["argo", "bgc"], "source": "GO-BGC" },
    { "id": "fact-21", "text": "A thermocline is a sharp temperature barrier that can be only centimeters thick, trapping nutrients and marine life.", "tags": ["oceanography", "thermocline"], "source": "NOAA" },
    { "id": "fact-22", "text": "This app's interactive maps are powered by Leaflet, a leading open-source library for mobile-friendly maps.", "tags": ["tech-stack", "leaflet"], "source": "FloatChat" },
    { "id": "fact-23", "text": "The Challenger Deep, the ocean's deepest known point, is located in the western Pacific at coordinates ~11.36° N, 142.58° E.", "tags": ["geography", "deep-sea"], "source": "Five Deeps Expedition" },
    { "id": "fact-24", "text": "Pressure increases by 1 atmosphere for every 10 meters of depth. At 1,000m, the pressure is about 100 times greater than at the surface!", "tags": ["pressure", "physics"], "source": "Oceanography 101" },
    { "id": "fact-25", "text": "The charts are rendered using Plotly.js, a powerful graphing library used for creating rich, interactive data visualizations.", "tags": ["tech-stack", "plotly"], "source": "FloatChat" }
  ]